In [19]:
import mysql.connector

In [25]:
db = mysql.connector.connect(
    host= 'localhost',
    user = 'root',
    password ='kiprop4170@'
)

In [14]:
if db:
    print("Connection successful")

Connection successful

In [45]:
cursor = db.cursor()

In [ ]:
cursor.execute("CREATE DATABASE FIRSTSQLDB")

In [6]:
cursor.execute("SHOW DATABASES")

In [8]:
for database in cursor:
    print(database)

In [27]:
cursor.execute("use firstsqldb")

In [40]:
cursor.execute("Create table Employees (ID INT AUTO_INCREMENT PRIMARY KEY, EmployeeNo Varchar(255), FirstName Varchar(255), LastName Varchar(255), Age INT, Role Varchar(75))")

In [28]:
cursor.execute("SHOW tables")

In [29]:
for tables in cursor:
    print(tables)

('departments',)
('employees',)

In [43]:
cursor.execute("ALTER table employees add column phone varchar(255)")

In [ ]:
cursor.execute("SHOW tables")

In [71]:
for tables in cursor:
    print(tables)

('employees',)

In [59]:
cursor.execute("DESCRIBE employees")

In [73]:
cursor.execute("DROP TABLE IF EXISTS departments")

In [75]:
cursor.execute("Create table departments (ID INT AUTO_INCREMENT PRIMARY KEY, Name Varchar(255))")

In [77]:
cursor.execute("ALTER table departments add column Head INT")

In [30]:
cursor.execute("ALTER table departments add FOREIGN KEY (Head) REFERENCES employees(ID) ")

In [31]:
cursor.execute("SELECT * FROM employees")

In [33]:
for row in cursor:
    print(row)

In [35]:
cursor.execute("ALTER TABLE employees ADD COLUMN DepartmentID INT")

In [36]:
cursor.execute("ALTER table employees add FOREIGN KEY (DepartmentID)  REFERENCES departments(id) ")

In [34]:
cursor.execute("INSERT INTO Departments (name) VALUES ('Human Resources'), ('Engineering'), ('Marketing')")

In [37]:
sql = "INSERT INTO employees (EmployeeNo, FirstName, LastName, DepartmentID ,Age, Phone ) VALUES (%s,%s, %s, %s, %s, %s)"
values= [

    ('101', 'Roy', 'Kiprop',1,22,'7004356234'),
    ('102', 'Victor', 'Ngeno',2,27,'7004634'),
    ('103', 'Brigit', 'Chelangat',3,21,'700436234'),
    ('104', 'Emily', 'Ruguru',2,21,'700432634')
      ]
cursor.executemany(sql,values)

#save Changes to DB

db.commit()

print(cursor.rowcount, "rows affected.")

4 rows affected.

In [38]:
data = "SELECT * FROM employees"
cursor.execute(data)

#Fetch data

result = cursor.fetchall()

#Print data 

for row in result:
    print(row)

(1, '101', 'Roy', 'Kiprop', 22, None, '7004356234', 1)
(2, '102', 'Victor', 'Ngeno', 27, None, '7004634', 2)
(3, '103', 'Brigit', 'Chelangat', 21, None, '700436234', 3)
(4, '104', 'Emily', 'Ruguru', 21, None, '700432634', 2)

In [39]:
data = "SELECT LastName, Age FROM employees"
cursor.execute(data)

result = cursor.fetchall()

for row in result:
    print(row)

('Kiprop', 22)
('Ngeno', 27)
('Chelangat', 21)
('Ruguru', 21)

In [40]:
# SELECT  LIMIT / ORDER / WHERE

data = "SELECT FirstName, Age  FROM employees WHERE Age <26  ORDER BY FirstName DESC LIMIT 2"
cursor.execute(data)

#Fetch Values

result = cursor.fetchall()

#Print values

for row in result:
    print(row)

('Roy', 22)
('Emily', 21)

In [42]:
# DELETE WHERE 

data = "DELETE  FROM employees WHERE Age < 21"
cursor.execute(data)

print(cursor.rowcount, "rows affected.")

0 rows affected.

In [43]:
# UPDATE 

data = "UPDATE employees SET Age = 23 WHERE Age =21"
cursor.execute(data)

print(cursor.rowcount, "rows affected.")

2 rows affected.

In [44]:
# JOINS 

data = "SELECT employees.FirstName, Departments.name  FROM employees INNER JOIN Departments ON  employees.DepartmentID=Departments.id ORDER BY FirstName ASC"
cursor.execute(data)

#Fetch Values

result = cursor.fetchall()

#Print values

for row in result:
    print(row)

('Brigit', 'Marketing')
('Emily', 'Engineering')
('Roy', 'Human Resources')
('Victor', 'Engineering')